{
  "$ref": "https://www.cert.ssi.gouv.fr/openapi.json",
  "affected_systems": [],
  "affected_systems_content": "<ul> <li>Red Hat Enterprise Linux versions 8 sans le correctif RHSA-2022:0267</li> <li>Red Hat Enterprise Linux version 8.4.0 Extended Update Support sans le correctif RHSA-2022:0266</li> <li>Red Hat Enterprise Linux versions 8.2.0 Extended Update Support sans le correctif RHSA-2022:0265</li> <li>Red Hat Enterprise Linux versions 8.1.0 Update Services for SAP Solutions, Advanced Update Support sans le correctif RHSA-2022:0268</li> <li>Red Hat Enterprise Linux versions 7 sans le correctif RHSA-2022:0274</li> <li>Red Hat Enterprise Linux versions 7.7 Update Services for SAP Solutions, Advanced Update Support sans le correctif RHSA-2022:0273</li> <li>Red Hat Enterprise Linux versions 7.6 Update Services for SAP Solutions, Advanced Update Support sans le correctif RHSA-2022:0271</li> <li>Red Hat Enterprise Linux versions 7.4 Advanced Update Support sans le correctif RHSA-2022:0272</li> <li>Red Hat Enterprise Linux versions 7.3 Advanced Update Support sans le correctif RHSA-2022:0270</li> <li>Red Hat Enterprise Linux versions 6 Extended Life-cycle Support sans le correctif RHSA-2022:0269</li> </ul> <p>L'éditeur ne propose pas de correctif pour les versions Red Hat suivantes :</p> <ul> <li>Red Hat Virtualization 4 for Red Hat Enterprise Linux 8</li> <li>Red Hat Virtualization 4 for Red Hat Enterprise Linux 7</li> </ul> <p>Se référer au bulletin de sécurité de l'éditeur dans la section Documentation pour obtenir des informations sur une mesure de contournement basée sur PolicyKit et à appliquer au cas où l'installation du correctif n'est pas possible.</p> ",
  "content": "## Solution\n\nSe référer au bulletin de sécurité de l'éditeur pour l'obtention des\ncorrectifs (cf. section Documentation).\n",
  "cves": [
    {
      "name": "CVE-2021-4034",
      "url": "https://www.cve.org/CVERecord?id=CVE-2021-4034"
    }
  ],
  "links": [],
  "reference": "CERTFR-2022-AVI-084",
  "revisions": [
    {
      "description": "Version initiale",
      "revision_date": "2022-01-27T00:00:00.000000"
    }
  ],
  "risks": [
    {
      "description": "Élévation de privilèges"
    }
  ],
  "summary": "Une vulnérabilité a été découverte dans pkexec de PolicyKit sur Red Hat.\nElle permet à un attaquant de provoquer une élévation de privilèges.\n",
  "title": "Vulnérabilité dans pkexec de PolicyKit sur Red Hat",
  "vendor_advisories": [
    {
      "published_at": null,
      "title": "Bulletin de sécurité Red Hat RHSB-2022-001 du 25 janvier 2022",
      "url": "https://access.redhat.com/security/vulnerabilities/RHSB-2022-001"
    }
  ]
}