{
  "$ref": "https://www.cert.ssi.gouv.fr/openapi.json",
  "affected_systems": [],
  "affected_systems_content": "<P>Logiciel Autocad 2000. Autocad LT n'est pas atteint car il ne  supporte pas le VBA.</P>",
  "content": "## Description\n\nCe virus nommé AC97M/Star est aussi connu sous le nom de ACAD/Star,\nACAD.Star, Autocad2k/Star, ou encore AC2KM/Star, il peut être classé\ndans la catégorie des virus de macro.\n\nIl se loge dans les dessins Autocad (Autocad Drawings), et se base sur\nla technique de W97M/Marker pour déceler s'il est déja présent dans un\ndocument ou non. C'est à dire qu'il recherche une chaîne de caractères\ntypes dans les fichiers qu'il peut infecter.\n\nIl contient aussi une part de code provenant de V5M/Radiant.\n\n## Détection\n\nIl ne se manifeste pas par une action, mais est repérable par le fait\nqu'un dessin non modifié vous proposera quand même d'enregistrer les\nchangements à sa fermeture. La procédure de fermeture peut aussi durer\nun peu plus longtemps que normalement à cause de l'exécution du code du\nvirus.\n\nCe virus possède une signature typique, il contient les chaînes de\ncaractères suivantes :\n\n    '[Autocad2k\\Star]\n    '[A.s.T]\n    'Big Greetz to some0ne really special\n    '\"You'll always be a star in my sky\"\n\n## Solution\n\nUtiliser un antivirus à jour. Actuellement, seul Viruscan de McAfee\nsemble détecter ce virus.\n",
  "cves": [],
  "links": [
    {
      "title": "Site McAfee :",
      "url": "http://vil.nai.com/villib/dispVirus.asp?virus_k=98745"
    }
  ],
  "reference": "CERTA-2000-AVI-019",
  "revisions": [
    {
      "description": "version initiale.",
      "revision_date": "2000-07-27T00:00:00.000000"
    }
  ],
  "risks": [
    {
      "description": "Selon mcafee, pour le moment aucun car cette version ne contient pas de code malfaisant... ce virus se contente uniquement de se propager"
    }
  ],
  "summary": "Un virus d'une nouvelle génération a été détecté. Il doit son\noriginalité à son environnement de développement : Autocad 2000.\n",
  "title": "Virus sous Autocad2000",
  "vendor_advisories": [
    {
      "published_at": null,
      "title": "Réseau de Confiance",
      "url": null
    },
    {
      "published_at": null,
      "title": "Infomations Virus de McAfee",
      "url": null
    }
  ]
}