{
  "$ref": "https://www.cert.ssi.gouv.fr/openapi.json",
  "affected_systems": [],
  "affected_systems_content": "<P>Service d'accès au courrier électronique par le Web  <SPAN class=\"textit\">XWebMail</SPAN> de la société XandMail.</P>",
  "content": "## Description\n\nXWebMail est un service d'accès au courrier électronique via une\ninterface Web.\n\nUne vulnérabilité permet, dans certains cas, de trouver l'URL qui donne\naccès au compte d'un utilisateur, sans authentification préalable. Il\nest alors possible de lire le courrier de cet utilisateur et d'envoyer\ndu courrier en son nom.\n\n## Solution\n\nLa société XandMail a affirmé au CERTA que tous les clients utilisant\nXWebMail étaient maintenant prévenus et que la vulnérabilité avait été\ncorrigée, et le correctif livré de manière individuelle et personalisée.\n\nSi vous offrez un service de messagerie par Web grâce au produit\nXWebMail et que vous n'avez pas été contacté par XandMail, envoyez un\ncourrier électronique à l'adresse security@xandmail.com.\n\n## Remerciements\n\nLa vulnérabilité a été découverte par la société Apogée Communications\n(http://www.apogee-com.fr) durant un audit effectué auprès d'un de ses\nclients, qui utilisait XWebMail. Après avoir été alerté par Apogée, le\nCERTA a pu qualifier la vulnérabilité et contacter la société XandMail,\ndans le but d'élaborer une parade adéquate.\n",
  "cves": [],
  "links": [],
  "reference": "CERTA-2002-AVI-062",
  "revisions": [
    {
      "description": "version initiale.",
      "revision_date": "2002-03-26T00:00:00.000000"
    }
  ],
  "risks": [
    {
      "description": "Accès au contenu d'une boîte aux lettres électronique et utilisation frauduleuse de celle-ci"
    }
  ],
  "summary": "Une vulnérabilité dans le service d'accès Web <span\nclass=\"textit\">XWebMail</span> de la société XandMail permet à un\nutilisateur mal intentionné d'accéder, sous certaines conditions, au\ncompte d'un autre utilisateur, de lire et d'envoyer du courrier depuis\nce compte.\n",
  "title": "Vulnérabilité dans le service d'accès Web <SPAN class=\"textit\">XWebMail</SPAN> de la société XandMail",
  "vendor_advisories": [
    {
      "published_at": null,
      "title": "Société de services «Apogée Communications»",
      "url": null
    }
  ]
}