{
  "$ref": "https://www.cert.ssi.gouv.fr/openapi.json",
  "affected_systems": [
    {
      "description": "Safari version 3.1.1. pour MacOS et versions antérieures.",
      "product": {
        "name": "Safari",
        "vendor": {
          "name": "Apple",
          "scada": false
        }
      }
    },
    {
      "description": "Safari version 3.1.1 pour Windows et versions antérieures ;",
      "product": {
        "name": "Safari",
        "vendor": {
          "name": "Apple",
          "scada": false
        }
      }
    }
  ],
  "affected_systems_content": null,
  "content": "## Description\n\nUne vulnérabilité a été découverte dans la navigateur Safari d'Apple.\nCette vulnérabilité permet via un site spécialement construit de forcer\nle téléchargement d'un fichier quelconque sur l'ordinateur de la\nvictime. Ce fichier est téléchargé directement dans le répertoire de\ntéléchargement défini dans les propriétés du navigateur (le Bureau par\ndéfaut).\n\nComme indiqué dans le bulletin d'actualité CERTA-2008-ACT-023, cette\nvulnérabilité peut également permettre l'exécution de code arbitraire\nsous Microsoft Windows. En effet, une « fonctionnalité » de Internet\nExplorer est de charger sous certaines conditions des bibliothèques de\nfonctions (DLL) depuis le bureau. Le téléchargement d'un tel fichier\nsous Safari suivi de l'exécution de Internet Explorer permet ainsi à une\npersonne malveillante d'exécuter du code arbitraire à distance.\n\nDe plus, une autre vulnérabilité a été découverte dans la manière de\ntraiter les fichiers BMP et GIF par Safari sous Microsoft Windows. Cette\nvulnérabilité peut être utilisée afin de lire certaines zones de la\nmémoire.\n\nUne dernière vulnérabilité sur Windows et MacOS concerne un problème de\ncorruption de mémoire dans le traitement de tableaux en Javascript par\nWebkit. Une personne malintentionnée pourrait exploiter cette faille\npour exécuter du code arbitraire à distance.\n\n## Solution\n\nSe référer aux bulletins de sécurité de l'éditeur pour l'obtention des\ncorrectifs (cf. section Documentation).\n",
  "cves": [
    {
      "name": "CVE-2008-1573",
      "url": "https://www.cve.org/CVERecord?id=CVE-2008-1573"
    },
    {
      "name": "CVE-2008-2306",
      "url": "https://www.cve.org/CVERecord?id=CVE-2008-2306"
    },
    {
      "name": "CVE-2008-2307",
      "url": "https://www.cve.org/CVERecord?id=CVE-2008-2307"
    }
  ],
  "links": [
    {
      "title": "Document du CERTA CERTA-2008-ALE-008 du 20 juin 2008 :",
      "url": "http://www.certa.ssi.gouv.fr/site/CERTA-2008-ALE-008/index.html"
    },
    {
      "title": "Bulletin de sécurité Apple HT2165 du 30 juin 2008 :",
      "url": "http://support.apple.com/kb/HT2165"
    }
  ],
  "reference": "CERTA-2008-AVI-331",
  "revisions": [
    {
      "description": "version initiale.",
      "revision_date": "2008-06-20T00:00:00.000000"
    },
    {
      "description": "ajout d'une référence au bulletin d'Apple sur MacOS et mise à jour de la description.",
      "revision_date": "2008-07-04T00:00:00.000000"
    }
  ],
  "risks": [
    {
      "description": "Exécution de code arbitraire à distance"
    },
    {
      "description": "Contournement de la politique de sécurité"
    }
  ],
  "summary": "Des vulnérabilités ont été découvertes dans la navigateur Safari. Ces\nvulnérabilités permettent un contournement de la politique de sécurité\net l'exécution de code arbitraire à distance sous Windows.\n",
  "title": "Vulnérabilité du navigateur Safari",
  "vendor_advisories": [
    {
      "published_at": null,
      "title": "Bulletin de sécurité Apple HT2092 du 19 juin 2008",
      "url": "http://support.apple.com/kb/HT2092"
    }
  ]
}