{
  "$ref": "https://www.cert.ssi.gouv.fr/openapi.json",
  "affected_systems": [],
  "affected_systems_content": "<P>Les versions CiscoWorks Wireless LAN Solution Engine (WLSE) et  CiscoWorks WLSE Express antérieures à 2.13.</P>",
  "content": "## Description\n\nCisco Wireless LAN Solution Engine (WLSE) est une application permettant\nde gérer et surveiller une infrastructure sans-fil Cisco. Deux\nvulnérabilités existent dans les versions de cette application\nantérieures à 2.13 :\n\n-   l'interface web des utilisateurs peut être utilisée par un\n    utilisateur malveillant pour faire une injection de code indirecte\n    (Cross Site Scripting), lui permettant d'obtenir des informations de\n    sessions suffisantes pour acquérir les droits de l'administrateur du\n    système.\n-   l'interface de commandes en ligne peut fournir un compte\n    administrateur à un utilisateur ayant accès à cette interface et\n    renseignant une commande particulière.\n\n## Solution\n\nSe référer au bulletin de sécurité de l'éditeur pour l'obtention des\ncorrectifs (cf. section Documentation).\n",
  "cves": [],
  "links": [
    {
      "title": "Bulletin de sécurité Cisco ID 69930 du 19 avril 2006 :",
      "url": "http://www.cisco.com/warp/public/707/cisco-sr-20060419-priv.shtml"
    },
    {
      "title": "Bulletin de sécurité Cisco ID 69920 du 19 avril 2006 :",
      "url": "http://www.cisco.com/warp/public/707/cisco-sa-20060419-wlse.shtml"
    }
  ],
  "reference": "CERTA-2006-AVI-168",
  "revisions": [
    {
      "description": "version initiale.",
      "revision_date": "2006-04-20T00:00:00.000000"
    }
  ],
  "risks": [
    {
      "description": "Élévation de privilèges"
    }
  ],
  "summary": "Des vulnérabilités existent dans certaines versions de Cisco Wireless\nLAN Solution Engine (WLSE) et WLSE Express. Un utilisateur malveillant\npeut utiliser l'une de ces vulnérabilités pour élever ses privilèges à\nceux d'administrateur.\n",
  "title": "Vulnérabilités dans Cisco CiscoWorks WLSE",
  "vendor_advisories": [
    {
      "published_at": null,
      "title": "Bulletin de sécurité de l'éditeur Cisco",
      "url": null
    }
  ]
}