{
  "$ref": "https://www.cert.ssi.gouv.fr/openapi.json",
  "affected_systems": [],
  "affected_systems_content": "<P>La plupart des systèmes peuvent être infectés par des virus  informatiques véhiculés par la messagerie. Cependant les virus  les plus fréquents s'attaquent en général aux systèmes les plus  répandus.</P>",
  "content": "## Description\n\nIl n'y a pas de fatalité vis-à-vis des virus informatiques. Ils se\npropagent essentiellement en exploitant :\n\n1.  de mauvaises configurations des systèmes d'information ;\n2.  une mauvaise sensibilisation de l'utilisateur.\n\nC'est pourquoi il est en général inutile de faire des alertes\nsystématiques sur chacun des virus qui sortent chaque jour. Le CERTA\ncommunique peu sur des virus particuliers et préfère régulièrement faire\nune note de rappel sur les bonnes pratiques.\n\n## 3.1 Les virus à la mode\n\nIl n'existe pas de statistiques fiables en matière de virus. Beaucoup de\nsources d'informations sur les virus, citant le nombre de spécimens en\ncirculation sans parler du montant des dégats imputés aux virus, sont\nparticulièrement fantaisistes. Peu importe, cette information est en\ngénéral inutile pour mettre en œuvre les mesures de protection\nnécessaires.\n\nLes sites suivants serviront arbitrairement de référence :\n\n-   http://www.wildlist.org\n\n-   http://www.messagelabs.com/viruseye/threats/list/default.asp\n\n-   http://www.vmyths.com\n\nBeaucoup trop de virus se propagent en exploitant une vulnérabilité du\nlogiciel Internet Explorer utilisé au travers du logiciel de messagerie\nOutlook. Le correctif de cette vulnérabilité a été publié en mars 2001\net fait l'objet de l'avis CERTA-2001-AVI-041.\n\nUne tendance des virus est d'arrêter les antivirus fonctionnant sur\nl'ordinateur contaminé. Si bien que plus que jamais, c'est la vigilance\nde l'utilisateur qui protège en dernier ressort.\n\n## Solution\n\nIl y a quelques règles de base pour se protéger contre les virus de\nmessagerie :\n\n1.  Pas de panique : les actions réalisées dans l'urgence, font souvent\n    plus de dégats que les virus.\n2.  Faites des sauvegardes. Le risque virus ne peut être complètement\n    réduit. Plutôt que limiter la propagation des virus (objectif\n    impossible), il vaut mieux limiter l'impact des virus (en\n    sauvegardant ce qu'ils peuvent détruire).\n3.  Mettez à jour vos systèmes d'exploitation et logiciels. Il s'agit\n    plus d'appliquer les correctifs de sécurité que d'ajouter de\n    nouvelles fonctionnalités.\n4.  Utilisez un parefeu. Certains virus installent un cheval de Troie ou\n    un relai (IRC, HTTP, SMTP, ...). Leur action est limitée si un\n    parefeu vous protège. Configurez le pour interdire les protocoles\n    que vous n'utilisez pas. Lisez régulièrement les journaux de votre\n    parefeu pour découvrir les tentatives de connexions suspectes.\n5.  Ne pas ouvrir les fichiers douteux. Un fichier douteux est un\n    fichier provenant d'une source non sûre :\n    -   les fichiers attachés, quelqu'en soit la source (vos amis vous\n        envoient aussi des virus, puisque les virus utilisent leur\n        carnet d'adresse). Préférez toujours échanger un texte saisi\n        dans le corps du message plutôt que d'attacher une pièce jointe.\n\n    -   les fichiers attachés exécutables sont quasi-systématiquement\n        des fichiers nuisibles. Ne pas hésiter à les détruire (ou les\n        mettre en quarantaine) dès le serveur de messagerie. (cf.\n\n            http://www.cnrs.fr/Infosecu/num41.pdf\n\n        ).\n\n    -   les fichiers téléchargés (ftp, http, disquettes, messagerie\n        instantanée, partage de fichier, ...)\n6.  Si le fichier vient d'une source connue demandez une confirmation\n    que le fichier attaché a bien été envoyé volontairement.\n7.  Si la source du fichier est inconnue, si vous avez un doute ...\n    n'ouvrez pas le fichier.\n8.  Si le titre ou le texte du message est douteux n'ouvrez pas le\n    message. Méfiez vous en particulier des titres qui jouent sur vos\n    affects et en particulier ceux qui exploitent l'actualité. Il peut\n    s'agir d'un virus ou d'un canular.\n9.  Les logiciels de messagerie sont généralement connus pour faire\n    mauvais ménage avec les anti-virus. Il est toujours préférable de\n    laisser au logiciel de messagerie le soin de gérer (envoyer,\n    recevoir) les messages et de ne lui laisser que la possibilité\n    d'enregistrer la pièce jointe et ne surtout pas l'exécuter. Les\n    antivirus du poste de travail pourront plus aisément traiter le\n    virus une fois sur le disque.\n10. Pour cela mettez régulièrement à jour vos antivirus.\n11. Dans le doute faîtes appel à votre responsable de sécurité\n    informatique.\n",
  "cves": [],
  "links": [
    {
      "title": "La revue de la sécurité des systèmes d'information au CNRS    publie régulièrement des articles très pertinents sur la lutte    contre les virus informatiques :",
      "url": "http://www.cnrs.fr/Infosecu/Revue.html"
    },
    {
      "title": "CERTA-2001-AVI-041 :",
      "url": "http://www.certa.ssi.gouv.fr/site/CERTA-2001-AVI-041/index.html"
    }
  ],
  "reference": "CERTA-2003-AVI-084",
  "revisions": [
    {
      "description": "version initiale.",
      "revision_date": "2003-05-12T00:00:00.000000"
    }
  ],
  "risks": [
    {
      "description": "Virus informatiques"
    }
  ],
  "summary": null,
  "title": "Rappel sur les virus de messagerie",
  "vendor_advisories": []
}